# ==========================================
# Repositorios de terceros (Taps)
# ==========================================
tap "nikitabobko/tap" # Requerido para AeroSpace
tap "homebrew/cask-fonts" # Útil si después quieres instalar tipografías con Nerd Fonts para tu terminal

# ==========================================
# Core CLI & Entorno Linux (Tu Stack de la Muerte)
# ==========================================
brew "stow"       # Gestor de dotfiles (symlinks mágicos)
brew "zsh"        # Zsh actualizado
brew "neovim"     # El editor supremo
brew "fzf"        # Buscador difuso
brew "fd"         # Alternativa ultrarrápida a 'find'
brew "bat"        # Clon de 'cat' con resaltado de sintaxis
brew "git-delta"  # El mejor pager para git diff y git log
brew "eza"        # Reemplazo moderno de 'ls' con iconos
brew "thefuck"    # Corrector de errores de tipeo en consola

# ==========================================
# Herramientas de Senior/Arquitecto Cloud
# ==========================================
brew "mise"       # Gestor universal de versiones (Node, Python, etc.)
brew "lazygit"    # Interfaz visual de Git para terminal
brew "lazydocker" # Interfaz visual para contenedores
brew "k9s"        # TUI para dominar Kubernetes a la velocidad de la luz
brew "1password-cli" # Indispensable para inyectar tus llaves SSH desde 1Password a la terminal

# ==========================================
# Aplicaciones Gráficas (Casks)
# ==========================================
# Entorno y Productividad
cask "1password"  # Bóveda de contraseñas y agente SSH
cask "raycast"    # Lanzador y automatizador (Tu Rofi en macOS)
# cask "aerospace"  # Tiling Window Manager (El toque Linux)
cask "ghostty"    # Terminal renderizada por GPU
cask "antigravity" 

# Contenedores y Desarrollo
cask "orbstack"   # Reemplazo ligero y rápido de Docker Desktop

# Bases de Datos & APIs
cask "datagrip"   # IDE de JetBrains para MySQL y otras BDs
cask "apidog"     # Documentación y consumo de APIs (El estándar de tu equipo)

# Navegador alternativo
# cask "zen-browser" # Tu navegador principal para igualar tu setup de PC